## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                  NAME                   |
|--------|-----------------------------------------|
| add    | `aws_quicksight_data_set.users`         |
|        | `aws_quicksight_refresh_schedule.users` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_quicksight_data_set.users will be created
  + resource "aws_quicksight_data_set" "users" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "users"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Users"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-owners"
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-viewers"
        }

      + physical_table_map {
          + physical_table_map_id = "users"

          + relational_table {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging"
              + name            = "users"

              + input_columns {
                  + name = "id"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "created_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "updated_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "name"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "email_address"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "mobile_number"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "password_changed_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "logged_in_at"
                  + type = "DATETIME"
                }
              + input_columns {
                  + name = "state"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "platform_admin"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "auth_type"
                  + type = "STRING"
                }
              + input_columns {
                  + name = "blocked"
                  + type = "BOOLEAN"
                }
              + input_columns {
                  + name = "password_expired"
                  + type = "BOOLEAN"
                }
            }
        }
    }

  # aws_quicksight_refresh_schedule.users will be created
  + resource "aws_quicksight_refresh_schedule" "users" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "users"
      + id             = (known after apply)
      + schedule_id    = "schedule-users"

      + schedule {
          + refresh_type          = "FULL_REFRESH"
          + start_after_date_time = (known after apply)

          + schedule_frequency {
              + interval        = "DAILY"
              + time_of_the_day = "07:40"
              + timezone        = (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudformation_stack.notification_history"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudformation_stack.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.login_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.users"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]

34 tests, 19 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
